app/Controllers/Absensi.php

    public function grafik()
    {
        $absensiModel = new AbsensiModel();

        // ===============================
        // 1. RANGE TANGGAL
        // ===============================
        $tawal  = $this->request->getGet('tawal');
        $takhir = $this->request->getGet('takhir');

        if (!$tawal)  $tawal = date('Y-m-01');
        if (!$takhir) $takhir = date('Y-m-d');

        $today = date('Y-m-d');
        $year  = date('Y');

        // ===============================
        // 2. HARIAN KELAS 10
        // ===============================
        $hari10 = ['hadir' => 0, 'izin' => 0, 'sakit' => 0, 'alfa' => 0];

        $result10 = (new AbsensiModel())
            ->select("keterangan, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('tb_siswa.kelas', '10')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('keterangan')
            ->findAll();
---
SELECT `keterangan`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `tb_siswa`.`kelas` = '10'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `keterangan`

        // ===============================
        $hari11 = ['hadir' => 0, 'izin' => 0, 'sakit' => 0, 'alfa' => 0];

        $result11 = (new AbsensiModel())
            ->select("keterangan, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('tb_siswa.kelas', '11')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('keterangan')
            ->findAll();
---
SELECT `keterangan`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `tb_siswa`.`kelas` = '11'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `keterangan`

        // ===============================
        $bulan10 = array_fill(0, 12, ['hadir' => 0, 'izin' => 0, 'sakit' => 0, 'alfa' => 0]);

        $resultB10 = (new AbsensiModel())
            ->select("MONTH(tanggal_absensi) AS bulan, keterangan, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('tb_siswa.kelas', '10')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('bulan, keterangan')
            ->findAll();
---
SELECT MONTH(tanggal_absensi) AS bulan, `keterangan`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `tb_siswa`.`kelas` = '10'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `bulan`, `keterangan`

        // ===============================
        $bulan11 = array_fill(0, 12, ['hadir' => 0, 'izin' => 0, 'sakit' => 0, 'alfa' => 0]);

        $resultB11 = (new AbsensiModel())
            ->select("MONTH(tanggal_absensi) AS bulan, keterangan, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('tb_siswa.kelas', '11')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('bulan, keterangan')
            ->findAll();
---
SELECT MONTH(tanggal_absensi) AS bulan, `keterangan`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `tb_siswa`.`kelas` = '11'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `bulan`, `keterangan`

        // 6. TOP 5
        // ===============================

        $topAlfa = (new AbsensiModel())
            ->select("tb_siswa.nama, tb_siswa.kelas, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('keterangan', 'alfa')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('tb_siswa.id_siswa')
            ->orderBy('total', 'DESC')
            ->limit(5)
            ->findAll();

        $topIzin = (new AbsensiModel())
            ->select("tb_siswa.nama, tb_siswa.kelas, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('keterangan', 'izin')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('tb_siswa.id_siswa')
            ->orderBy('total', 'DESC')
            ->limit(5)
            ->findAll();

        $topSakit = (new AbsensiModel())
            ->select("tb_siswa.nama, tb_siswa.kelas, COUNT(*) AS total")
            ->join('tb_siswa', 'tb_siswa.id_siswa = tb_absensi.id_siswa')
            ->where('keterangan', 'sakit')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->groupBy('tb_siswa.id_siswa')
            ->orderBy('total', 'DESC')
            ->limit(5)
            ->findAll();

        // ===============================
        // 7. PERSENTASE
        // ===============================
        $izin = (new AbsensiModel())
            ->where('keterangan', 'izin')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->countAllResults();

        $sakit = (new AbsensiModel())
            ->where('keterangan', 'sakit')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->countAllResults();

        $alfa = (new AbsensiModel())
            ->where('keterangan', 'alfa')
            ->where("DATE(tanggal_absensi) BETWEEN '$tawal' AND '$takhir'")
            ->countAllResults();
---
SELECT `tb_siswa`.`nama`, `tb_siswa`.`kelas`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `keterangan` = 'alfa'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `tb_siswa`.`id_siswa`
ORDER BY `total` DESC
 LIMIT 5
SELECT `tb_siswa`.`nama`, `tb_siswa`.`kelas`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `keterangan` = 'izin'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `tb_siswa`.`id_siswa`
ORDER BY `total` DESC
 LIMIT 5
SELECT `tb_siswa`.`nama`, `tb_siswa`.`kelas`, COUNT(*) AS total
FROM `tb_absensi`
JOIN `tb_siswa` ON `tb_siswa`.`id_siswa` = `tb_absensi`.`id_siswa`
WHERE `keterangan` = 'sakit'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
GROUP BY `tb_siswa`.`id_siswa`
ORDER BY `total` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `tb_absensi`
WHERE `keterangan` = 'izin'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
SELECT COUNT(*) AS `numrows`
FROM `tb_absensi`
WHERE `keterangan` = 'sakit'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'
SELECT COUNT(*) AS `numrows`
FROM `tb_absensi`
WHERE `keterangan` = 'alfa'
AND DATE(tanggal_absensi) BETWEEN '2025-12-01' AND '2025-12-02'