app/Controllers/Guru.php

SELECT *
FROM `tb_guru`
---
    public function index()
    {
        $guruModel = new GuruModel();
        $data['guru'] = $guruModel->findAll();