app/Controllers/Materi.php

SELECT `tb_materi`.*, `tb_mapel`.`nama_mapel`
FROM `tb_materi`
JOIN `tb_mapel` ON `tb_mapel`.`id_mapel` = `tb_materi`.`id_mapel`
WHERE `tb_materi`.`id_guru` = 'G002'
ORDER BY `tb_materi`.`nomor_materi` ASC
---
    public function index()
    {
        $id_guru = session()->get('id_user');

        $materi = $this->materiModel
            ->select('tb_materi.*, tb_mapel.nama_mapel')
            ->join('tb_mapel', 'tb_mapel.id_mapel = tb_materi.id_mapel')
            ->where('tb_materi.id_guru', $id_guru)
            ->orderBy('tb_materi.nomor_materi', 'ASC')
            ->findAll();