app/Controllers/Murid.php

SELECT *
FROM `tb_siswa`
---
    public function index()
    {
        $siswaModel = new SiswaModel();
        $data['siswa'] = $siswaModel->findAll();