app/Controllers/Referensi.php

SELECT `tb_referensi`.*, `tb_materi`.`nomor_materi`, `tb_materi`.`judul` as `judul_materi`, `tb_materi`.`kelas`, `tb_materi`.`tahun_target`
FROM `tb_referensi`
JOIN `tb_materi` ON `tb_materi`.`id_materi` = `tb_referensi`.`id_materi`
WHERE `tb_materi`.`id_guru` = 'G002'
ORDER BY `tb_referensi`.`created_at` DESC
---
    public function index()
    {
        $idGuru = session()->get('id_user');

        $referensiModel = new ReferensiModel();
        $materiModel = new MateriModel();

        // Ambil referensi milik guru login, join dengan materi untuk ambil nomor_materi, judul, kelas, tahun_target
        $referensi = $referensiModel
            ->select('tb_referensi.*, tb_materi.nomor_materi, tb_materi.judul as judul_materi, tb_materi.kelas, tb_materi.tahun_target')
            ->join('tb_materi', 'tb_materi.id_materi = tb_referensi.id_materi')
            ->where('tb_materi.id_guru', $idGuru)
            ->orderBy('tb_referensi.created_at', 'DESC')
            ->findAll();

SELECT *
FROM `tb_materi`
WHERE `id_guru` = 'G002'
---
    public function tambah()
    {
        $materiModel = new MateriModel();

        // Ambil hanya materi milik guru yang login
        $idGuru = session()->get('id_user');
        $materi = $materiModel->where('id_guru', $idGuru)->findAll();