app/Controllers/Tugas.php

SELECT `tb_tugas`.*, `tb_materi`.`nomor_materi`, `tb_materi`.`judul`
FROM `tb_tugas`
JOIN `tb_materi` ON `tb_materi`.`id_materi` = `tb_tugas`.`id_materi`
WHERE `tb_materi`.`id_guru` = 'G002'
ORDER BY `tb_tugas`.`created_at` DESC
---
    public function index()
    {
        $idGuru = session()->get('id_user');

        $model = new TugasModel();
        $tugas = $model->select('tb_tugas.*, tb_materi.nomor_materi, tb_materi.judul')
            ->join('tb_materi', 'tb_materi.id_materi = tb_tugas.id_materi')
            ->where('tb_materi.id_guru', $idGuru)
            ->orderBy('tb_tugas.created_at', 'DESC')
            ->findAll();